import React, { useState } from 'react';
import { useNavigate } from 'react-router-dom';
import '../styles/ServicesDropdown.css'; 

const allServices = [
  "Замена или ремонт микровыключателей",
  "Замена или ремонт заварочного блока",
  "Замена или ремонт редуктора",
  "Замена или ремонт уплотнительного кольца",
  "Замена или ремонт кофевода",
  "Замена или ремонт колец штуцера",
  "Чистка кофемолки",
  "Замена или ремонт жерновов (ножей)",
  "Замена счётчика воды",
  "Замена или ремонт насоса",
  "Замена или ремонт электромагнитного клапана",
  "Удаление накипи и чистка гидросистемы",
  "Замена или ремонт термостата",
  "Замена или ремонт предохранителей",
  "Замена или ремонт блока управления",
  "Замена или ремонт тэна (нагревательного элемента)",
  "Замена или ремонт кольца дозатора",
  "Замена или ремонт кофемолки",
  "Смазка всех узлов",
  "Замена или ремонт термоблока",
  "Замена или ремонт пароблока",
  "Замена или ремонт верхнего поршня",
  "Замена или ремонт двигателя",
  "Замена или ремонт штуцера",
  "Замена или ремонт капучинатора",
  "Замена или ремонт дренажного клапана",
  "Чистка диспенсера",
  "Замена или ремонт бойлера",
  "Декальцинация",
  "Замена или ремонт силовой платы",
  "Замена или ремонт платы",
  "Замена или ремонт прокладок",
  "Декофенация",
  "Замена или ремонт дисплея",
  "Замена или ремонт одометра",
  "Замена или ремонт энкодера",
  "Замена или ремонт кнопок",
  "Замена или ремонт сетевого шнура",
  "Замена или ремонт электпроводки",
  "Замена или ремонт светового индикатора",
  "Запуск кофемашины",
  "Замена фильтра кофемашины",
  "Замена или ремонт холдера (рожка)",
  "Замена или ремонт парового крана",
  "Замена или ремонт крана подачи кипятка",
  "Замена или ремонт индикатора уровня воды",
  "Замена или ремонт датчиков",
  "Замена или ремонт датчиков давления пара",
  "Замена или ремонт манометра",
  "Замена или ремонт переключателей",
  "Замена или ремонт помпы",
  "Замена или ремонт прессостата"
];

const ServicesDropdown = () => {
  const [isOpen, setIsOpen] = useState(false);
  const navigate = useNavigate(); 

  const toggleDropdown = () => {
    setIsOpen(!isOpen);
  };

  const handleServiceClick = (service) => {
    const translit = {
      'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'yo', 'ж': 'zh',
      'з': 'z', 'и': 'i', 'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o',
      'п': 'p', 'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'kh', 'ц': 'ts',
      'ч': 'ch', 'ш': 'sh', 'щ': 'shch', 'ы': 'y', 'э': 'e', 'ю': 'yu', 'я': 'ya',
      'ъ': '', 'ь': ''
    };
  
    const slug = service
      .toLowerCase()
      .split('')
      .map(char => translit[char] || char)
      .join('')
      .replace(/ /g, '-')
      .replace(/[^a-z0-9-]+/g, '');
  
    window.location.href = `/service/${slug}`;
  };

  return (
    <div className="services-dropdown" 
         onMouseEnter={toggleDropdown} 
         onMouseLeave={toggleDropdown}
    >
      <div className="dropdown-button">
        Услуги по ремонту
      </div>
      {isOpen && (
        <ul className="dropdown-content">
          {allServices.map((service, index) => (
            <li key={index} onClick={() => handleServiceClick(service)}>
              {service}
            </li>
          ))}
        </ul>
      )}
    </div>
  );
};

export default ServicesDropdown;